Revit 2027 API
ProjectLocationSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ProjectLocationSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As ProjectLocationSetIterator
public:
virtual ProjectLocationSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ProjectLocationSetIterator
override ForwardIterator : unit -> ProjectLocationSetIterator
Return Value
ProjectLocationSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
ProjectLocationSet Class
Autodesk.Revit.DB Namespace